# Опишіть функцію з назвою bubble_sort, яка отримує єдиний аргумент "sequence" - список, який потрібно відсортувати.
def bubble_sort(sequence):
    # Перебирати в діапазоні чисел від 0 до довжини послідовності.
    for counter in range(len(sequence)):
        # Ітерація в діапазоні чисел від 0 до (довжина послідовності - поточна ітерація - 1).
        for index in range(len(sequence) - counter - 1):
            # Порівняти поточний елемент з наступним елементом у послідовності.
            # Якщо поточний елемент більший за наступний, поміняйте їх місцями.
            if sequence[index] > sequence[index+1]:
                sequence[index], sequence[index+1] = sequence[index+1], sequence[index]
        # Вивести поточний стан послідовності після кожного проходу через внутрішній цикл.
        print(sequence)
    # Повернути відсортовану послідовність.
    return sequence

# Якщо цей скрипт виконується безпосередньо (а не імпортується як модуль), виконується операція сортування.
if __name__ == "__main__":
    # Визначити список to_sort, що містить невідсортовані цілі числа.
    to_sort = [15, 9, 8, 1, 4, 11, 7, 12, 13, 6, 5, 3, 16, 2, 10, 14]
    # Викликати функцію bubble_sort зі списком to_sort в якості аргументу і вивести результат.
    print(bubble_sort(to_sort))
